{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      "!": 3,
      "'": 4,
      "1": 5,
      "2": 6,
      ",": 7,
      "3": 8,
      ".": 9,
      "4": 10,
      "5": 11,
      "6": 12,
      "?": 13,
      "a": 14,
      "b": 15,
      "c": 16,
      "d": 17,
      "e": 18,
      "f": 19,
      "g": 20,
      "h": 21,
      "i": 22,
      "j": 23,
      "k": 24,
      "l": 25,
      "m": 26,
      "n": 27,
      "o": 28,
      "p": 29,
      "q": 30,
      "r": 31,
      "s": 32,
      "t": 33,
      "u": 34,
      "v": 35,
      "w": 36,
      "x": 37,
      "y": 38,
      "z": 39,
      "ng": 40,
      "aa": 41,
      "ja": 42,
      "ai": 43,
      "ou": 44,
      "oi": 45,
      "ei": 46,
      "ji": 47,
      "yu": 48,
      "ung": 49,
      "eng": 50,
      "au": 51,
      "ge": 52,
      "si": 53,
      "eoi": 54,
      "zi": 55,
      "oeng": 56,
      "hai": 57,
      "in": 58,
      "jat": 59,
      "an": 60,
      "ok": 61,
      "ong": 62,
      "dou": 63,
      "aan": 64,
      "ing": 65,
      "aai": 66,
      "jau": 67,
      "jyu": 68,
      "am": 69,
      "go": 70,
      "jan": 71,
      "gw": 72,
      "at": 73,
      "keoi": 74,
      "ngo": 75,
      "gaa": 76,
      "zung": 77,
      "uk": 78,
      "ang": 79,
      "zau": 80,
      "di": 81,
      "soeng": 82,
      "hou": 83,
      "eo": 84,
      "syu": 85,
      "wu": 86,
      "zyu": 87,
      "un": 88,
      "gam": 89,
      "tung": 90,
      "waa": 91,
      "zo": 92,
      "wai": 93,
      "ci": 94,
      "dei": 95,
      "hok": 96,
      "ak": 97,
      "hau": 98,
      "haa": 99,
      "jin": 100,
      "daai": 101,
      "mou": 102,
      "bat": 103,
      "gei": 104,
      "saa": 105,
      "wui": 106,
      "gong": 107,
      "ho": 108,
      "laa": 109,
      "siu": 110,
      "lei": 111,
      "man": 112,
      "ne": 113,
      "yun": 114,
      "iu": 115,
      "dak": 116,
      "fu": 117,
      "gwok": 118,
      "sing": 119,
      "aat": 120,
      "jiu": 121,
      "joeng": 122,
      "sau": 123,
      "tai": 124,
      "eon": 125,
      "jyun": 126,
      "ging": 127,
      "heoi": 128,
      "min": 129,
      "zoeng": 130,
      "ap": 131,
      "jing": 132,
      "hei": 133,
      "ze": 134,
      "hoeng": 135,
      "eot": 136,
      "nin": 137,
      "jik": 138,
      "bin": 139,
      "sik": 140,
      "daan": 141,
      "fong": 142,
      "baa": 143,
      "gau": 144,
      "gwo": 145,
      "gung": 146,
      "bun": 147,
      "sam": 148,
      "cing": 149,
      "saang": 150,
      "nei": 151,
      "ceot": 152,
      "zing": 153,
      "sai": 154,
      "lai": 155,
      "kei": 156,
      "zou": 157,
      "do": 158,
      "bei": 159,
      "seng": 160,
      "san": 161,
      "maa": 162,
      "zok": 163,
      "lou": 164,
      "faan": 165,
      "mei": 166,
      "cung": 167,
      "lau": 168,
      "ek": 169,
      "jung": 170,
      "zoi": 171,
      "seoi": 172,
      "faat": 173,
      "cin": 174,
      "gin": 175,
      "fan": 176,
      "aam": 177,
      "hoi": 178,
      "ni": 179,
      "deoi": 180,
      "ling": 181,
      "zik": 182,
      "leoi": 183,
      "bou": 184,
      "wan": 185,
      "it": 186,
      "gu": 187,
      "duk": 188,
      "gaai": 189,
      "dung": 190,
      "loeng": 191,
      "sin": 192,
      "dik": 193,
      "gaau": 194,
      "ui": 195,
      "zai": 196,
      "coeng": 197,
      "ik": 198,
      "dai": 199,
      "zaa": 200,
      "dim": 201,
      "so": 202,
      "zeoi": 203,
      "maai": 204,
      "sang": 205,
      "tau": 206,
      "cyun": 207,
      "sat": 208,
      "dong": 209,
      "se": 210,
      "sap": 211,
      "wong": 212,
      "zan": 213,
      "tin": 214,
      "jyut": 215,
      "je": 216,
      "mun": 217,
      "gaan": 218,
      "mat": 219,
      "hung": 220,
      "gan": 221,
      "baan": 222,
      "ming": 223,
      "gok": 224,
      "loi": 225,
      "ceoi": 226,
      "daa": 227,
      "ngoi": 228,
      "sei": 229,
      "jam": 230,
      "nang": 231,
      "taai": 232,
      "oek": 233,
      "doi": 234,
      "jap": 235,
      "syun": 236,
      "saam": 237,
      "haau": 238,
      "faa": 239,
      "mong": 240,
      "tou": 241,
      "fung": 242,
      "fo": 243,
      "baak": 244,
      "geoi": 245,
      "ding": 246,
      "dang": 247,
      "teng": 248,
      "co": 249,
      "gun": 250,
      "hang": 251,
      "gou": 252,
      "din": 253,
      "lik": 254
    },
    "merges": [
      [
        "n",
        "g"
      ],
      [
        "a",
        "a"
      ],
      [
        "j",
        "a"
      ],
      [
        "a",
        "i"
      ],
      [
        "o",
        "u"
      ],
      [
        "o",
        "i"
      ],
      [
        "e",
        "i"
      ],
      [
        "j",
        "i"
      ],
      [
        "y",
        "u"
      ],
      [
        "u",
        "ng"
      ],
      [
        "e",
        "ng"
      ],
      [
        "a",
        "u"
      ],
      [
        "g",
        "e"
      ],
      [
        "s",
        "i"
      ],
      [
        "e",
        "oi"
      ],
      [
        "z",
        "i"
      ],
      [
        "o",
        "eng"
      ],
      [
        "h",
        "ai"
      ],
      [
        "i",
        "n"
      ],
      [
        "ja",
        "t"
      ],
      [
        "a",
        "n"
      ],
      [
        "o",
        "k"
      ],
      [
        "o",
        "ng"
      ],
      [
        "d",
        "ou"
      ],
      [
        "aa",
        "n"
      ],
      [
        "i",
        "ng"
      ],
      [
        "aa",
        "i"
      ],
      [
        "ja",
        "u"
      ],
      [
        "j",
        "yu"
      ],
      [
        "a",
        "m"
      ],
      [
        "g",
        "o"
      ],
      [
        "ja",
        "n"
      ],
      [
        "g",
        "w"
      ],
      [
        "a",
        "t"
      ],
      [
        "k",
        "eoi"
      ],
      [
        "ng",
        "o"
      ],
      [
        "g",
        "aa"
      ],
      [
        "z",
        "ung"
      ],
      [
        "u",
        "k"
      ],
      [
        "a",
        "ng"
      ],
      [
        "z",
        "au"
      ],
      [
        "d",
        "i"
      ],
      [
        "s",
        "oeng"
      ],
      [
        "h",
        "ou"
      ],
      [
        "e",
        "o"
      ],
      [
        "s",
        "yu"
      ],
      [
        "w",
        "u"
      ],
      [
        "z",
        "yu"
      ],
      [
        "u",
        "n"
      ],
      [
        "g",
        "am"
      ],
      [
        "t",
        "ung"
      ],
      [
        "w",
        "aa"
      ],
      [
        "z",
        "o"
      ],
      [
        "w",
        "ai"
      ],
      [
        "c",
        "i"
      ],
      [
        "d",
        "ei"
      ],
      [
        "h",
        "ok"
      ],
      [
        "a",
        "k"
      ],
      [
        "h",
        "au"
      ],
      [
        "h",
        "aa"
      ],
      [
        "ji",
        "n"
      ],
      [
        "d",
        "aai"
      ],
      [
        "m",
        "ou"
      ],
      [
        "b",
        "at"
      ],
      [
        "g",
        "ei"
      ],
      [
        "s",
        "aa"
      ],
      [
        "wu",
        "i"
      ],
      [
        "g",
        "ong"
      ],
      [
        "h",
        "o"
      ],
      [
        "l",
        "aa"
      ],
      [
        "si",
        "u"
      ],
      [
        "l",
        "ei"
      ],
      [
        "m",
        "an"
      ],
      [
        "n",
        "e"
      ],
      [
        "yu",
        "n"
      ],
      [
        "i",
        "u"
      ],
      [
        "d",
        "ak"
      ],
      [
        "f",
        "u"
      ],
      [
        "gw",
        "ok"
      ],
      [
        "si",
        "ng"
      ],
      [
        "aa",
        "t"
      ],
      [
        "ji",
        "u"
      ],
      [
        "j",
        "oeng"
      ],
      [
        "s",
        "au"
      ],
      [
        "t",
        "ai"
      ],
      [
        "eo",
        "n"
      ],
      [
        "jyu",
        "n"
      ],
      [
        "g",
        "ing"
      ],
      [
        "h",
        "eoi"
      ],
      [
        "m",
        "in"
      ],
      [
        "z",
        "oeng"
      ],
      [
        "a",
        "p"
      ],
      [
        "ji",
        "ng"
      ],
      [
        "h",
        "ei"
      ],
      [
        "z",
        "e"
      ],
      [
        "h",
        "oeng"
      ],
      [
        "eo",
        "t"
      ],
      [
        "n",
        "in"
      ],
      [
        "ji",
        "k"
      ],
      [
        "b",
        "in"
      ],
      [
        "si",
        "k"
      ],
      [
        "d",
        "aan"
      ],
      [
        "f",
        "ong"
      ],
      [
        "b",
        "aa"
      ],
      [
        "g",
        "au"
      ],
      [
        "gw",
        "o"
      ],
      [
        "g",
        "ung"
      ],
      [
        "b",
        "un"
      ],
      [
        "s",
        "am"
      ],
      [
        "c",
        "ing"
      ],
      [
        "saa",
        "ng"
      ],
      [
        "n",
        "ei"
      ],
      [
        "c",
        "eot"
      ],
      [
        "zi",
        "ng"
      ],
      [
        "s",
        "ai"
      ],
      [
        "l",
        "ai"
      ],
      [
        "k",
        "ei"
      ],
      [
        "z",
        "ou"
      ],
      [
        "d",
        "o"
      ],
      [
        "b",
        "ei"
      ],
      [
        "s",
        "eng"
      ],
      [
        "s",
        "an"
      ],
      [
        "m",
        "aa"
      ],
      [
        "z",
        "ok"
      ],
      [
        "l",
        "ou"
      ],
      [
        "f",
        "aan"
      ],
      [
        "m",
        "ei"
      ],
      [
        "c",
        "ung"
      ],
      [
        "l",
        "au"
      ],
      [
        "e",
        "k"
      ],
      [
        "j",
        "ung"
      ],
      [
        "z",
        "oi"
      ],
      [
        "s",
        "eoi"
      ],
      [
        "f",
        "aat"
      ],
      [
        "c",
        "in"
      ],
      [
        "g",
        "in"
      ],
      [
        "f",
        "an"
      ],
      [
        "aa",
        "m"
      ],
      [
        "h",
        "oi"
      ],
      [
        "n",
        "i"
      ],
      [
        "d",
        "eoi"
      ],
      [
        "l",
        "ing"
      ],
      [
        "zi",
        "k"
      ],
      [
        "l",
        "eoi"
      ],
      [
        "b",
        "ou"
      ],
      [
        "w",
        "an"
      ],
      [
        "i",
        "t"
      ],
      [
        "g",
        "u"
      ],
      [
        "d",
        "uk"
      ],
      [
        "g",
        "aai"
      ],
      [
        "d",
        "ung"
      ],
      [
        "l",
        "oeng"
      ],
      [
        "si",
        "n"
      ],
      [
        "di",
        "k"
      ],
      [
        "gaa",
        "u"
      ],
      [
        "u",
        "i"
      ],
      [
        "z",
        "ai"
      ],
      [
        "c",
        "oeng"
      ],
      [
        "i",
        "k"
      ],
      [
        "d",
        "ai"
      ],
      [
        "z",
        "aa"
      ],
      [
        "di",
        "m"
      ],
      [
        "s",
        "o"
      ],
      [
        "z",
        "eoi"
      ],
      [
        "m",
        "aai"
      ],
      [
        "s",
        "ang"
      ],
      [
        "t",
        "au"
      ],
      [
        "c",
        "yun"
      ],
      [
        "s",
        "at"
      ],
      [
        "d",
        "ong"
      ],
      [
        "s",
        "e"
      ],
      [
        "s",
        "ap"
      ],
      [
        "w",
        "ong"
      ],
      [
        "z",
        "an"
      ],
      [
        "t",
        "in"
      ],
      [
        "jyu",
        "t"
      ],
      [
        "j",
        "e"
      ],
      [
        "m",
        "un"
      ],
      [
        "g",
        "aan"
      ],
      [
        "m",
        "at"
      ],
      [
        "h",
        "ung"
      ],
      [
        "g",
        "an"
      ],
      [
        "b",
        "aan"
      ],
      [
        "m",
        "ing"
      ],
      [
        "g",
        "ok"
      ],
      [
        "l",
        "oi"
      ],
      [
        "c",
        "eoi"
      ],
      [
        "d",
        "aa"
      ],
      [
        "ng",
        "oi"
      ],
      [
        "s",
        "ei"
      ],
      [
        "ja",
        "m"
      ],
      [
        "n",
        "ang"
      ],
      [
        "t",
        "aai"
      ],
      [
        "o",
        "ek"
      ],
      [
        "d",
        "oi"
      ],
      [
        "ja",
        "p"
      ],
      [
        "syu",
        "n"
      ],
      [
        "saa",
        "m"
      ],
      [
        "haa",
        "u"
      ],
      [
        "f",
        "aa"
      ],
      [
        "m",
        "ong"
      ],
      [
        "t",
        "ou"
      ],
      [
        "f",
        "ung"
      ],
      [
        "f",
        "o"
      ],
      [
        "baa",
        "k"
      ],
      [
        "ge",
        "oi"
      ],
      [
        "d",
        "ing"
      ],
      [
        "d",
        "ang"
      ],
      [
        "t",
        "eng"
      ],
      [
        "c",
        "o"
      ],
      [
        "g",
        "un"
      ],
      [
        "h",
        "ang"
      ],
      [
        "g",
        "ou"
      ],
      [
        "d",
        "in"
      ],
      [
        "l",
        "ik"
      ]
    ]
  }
}