{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      "!": 3,
      "'": 4,
      "1": 5,
      "2": 6,
      ",": 7,
      "3": 8,
      ".": 9,
      "4": 10,
      "5": 11,
      "6": 12,
      "?": 13,
      "a": 14,
      "b": 15,
      "c": 16,
      "d": 17,
      "e": 18,
      "f": 19,
      "g": 20,
      "h": 21,
      "i": 22,
      "j": 23,
      "k": 24,
      "l": 25,
      "m": 26,
      "n": 27,
      "o": 28,
      "p": 29,
      "q": 30,
      "r": 31,
      "s": 32,
      "t": 33,
      "u": 34,
      "v": 35,
      "w": 36,
      "x": 37,
      "y": 38,
      "z": 39,
      "ng": 40,
      "aa": 41,
      "i6": 42,
      "ja": 43,
      "ou": 44,
      "ng1": 45,
      "oi": 46,
      "ge": 47,
      "n4": 48,
      "yu": 49,
      "ji": 50,
      "ng4": 51,
      "ha": 52,
      "i2": 53,
      "t1": 54,
      "ge3": 55,
      "oe": 56,
      "k6": 57,
      "eoi": 58,
      "n1": 59,
      "au": 60,
      "si": 61,
      "ng2": 62,
      "go": 63,
      "i3": 64,
      "n6": 65,
      "dou": 66,
      "i1": 67,
      "jat1": 68,
      "hai6": 69,
      "ng6": 70,
      "i4": 71,
      "k1": 72,
      "sa": 73,
      "jau": 74,
      "k3": 75,
      "gaa": 76,
      "n2": 77,
      "eoi5": 78,
      "o2": 79,
      "i5": 80,
      "ung1": 81,
      "jyu": 82,
      "ngo": 83,
      "gw": 84,
      "t6": 85,
      "daa": 86,
      "m4": 87,
      "ou2": 88,
      "jau5": 89,
      "ga": 90,
      "keoi5": 91,
      "ung4": 92,
      "ngo5": 93,
      "n3": 94,
      "ng3": 95,
      "u3": 96,
      "gi": 97,
      "eo": 98,
      "u2": 99,
      "ho": 100,
      "au6": 101,
      "jan4": 102,
      "wa": 103,
      "t3": 104,
      "aa1": 105,
      "zi": 106,
      "ok3": 107,
      "soe": 108,
      "da": 109,
      "eoi3": 110,
      "u6": 111,
      "ei6": 112,
      "waa": 113,
      "at1": 114,
      "go3": 115,
      "ne": 116,
      "di": 117,
      "syu": 118,
      "hou2": 119,
      "m1": 120,
      "ng5": 121,
      "wu": 122,
      "zyu": 123,
      "dou1": 124,
      "ci": 125,
      "zau6": 126,
      "p6": 127,
      "se": 128,
      "faa": 129,
      "haa": 130,
      "bi": 131,
      "uk6": 132,
      "ma": 133,
      "zi2": 134,
      "li": 135,
      "saa": 136,
      "hai2": 137,
      "hok6": 138,
      "dei6": 139,
      "mi": 140,
      "ji5": 141,
      "do": 142,
      "ung6": 143,
      "zo2": 144,
      "zung1": 145,
      "m3": 146,
      "ei4": 147,
      "tung4": 148,
      "bat1": 149,
      "zi1": 150,
      "ou5": 151,
      "baa": 152,
      "au4": 153,
      "za": 154,
      "oeng1": 155,
      "dou2": 156,
      "au2": 157,
      "joe": 158,
      "daai6": 159,
      "gong2": 160,
      "ne1": 161,
      "maa": 162,
      "syu1": 163,
      "m2": 164,
      "fo": 165,
      "gwok3": 166,
      "ni": 167,
      "la": 168,
      "hau6": 169,
      "gam3": 170,
      "ou6": 171,
      "si6": 172,
      "ta": 173,
      "ze": 174,
      "zi6": 175,
      "he": 176,
      "ji4": 177,
      "dak1": 178,
      "rngo5": 179,
      "gaa1": 180,
      "bu": 181,
      "gwo": 182,
      "ti": 183,
      "laa1": 184,
      "ei5": 185,
      "wai6": 186,
      "dou6": 187,
      "u1": 188,
      "heoi3": 189,
      "aa3": 190,
      "nin4": 191,
      "si4": 192,
      "jiu3": 193,
      "siu2": 194,
      "mu": 195,
      "zyu6": 196,
      "rkeoi5": 197,
      "ceo": 198,
      "min6": 199,
      "fa": 200,
      "mou5": 201,
      "n5": 202,
      "jik6": 203,
      "jin4": 204,
      "ung2": 205,
      "di1": 206,
      "oi3": 207,
      "si1": 208,
      "oi4": 209,
      "uk1": 210,
      "gei2": 211,
      "ou4": 212,
      "waa6": 213,
      "ceot1": 214,
      "ho2": 215,
      "ong4": 216,
      "jat6": 217,
      "saang1": 218,
      "ca": 219,
      "nei5": 220,
      "tai2": 221,
      "man4": 222,
      "rz": 223,
      "gwo3": 224,
      "daan6": 225,
      "soeng5": 226,
      "be": 227,
      "gung1": 228,
      "wui5": 229,
      "cyu": 230,
      "oi1": 231,
      "faat3": 232,
      "sik1": 233,
      "sam1": 234,
      "go2": 235,
      "au3": 236,
      "ging1": 237,
      "do1": 238,
      "lei4": 239,
      "ji6": 240,
      "oeng4": 241,
      "naa": 242,
      "taa": 243,
      "lau4": 244,
      "zok3": 245,
      "sing4": 246,
      "ou3": 247,
      "seng1": 248,
      "pi": 249,
      "jyun4": 250,
      "caa": 251,
      "zaa": 252,
      "oi6": 253,
      "ok6": 254
    },
    "merges": [
      [
        "n",
        "g"
      ],
      [
        "a",
        "a"
      ],
      [
        "i",
        "6"
      ],
      [
        "j",
        "a"
      ],
      [
        "o",
        "u"
      ],
      [
        "ng",
        "1"
      ],
      [
        "o",
        "i"
      ],
      [
        "g",
        "e"
      ],
      [
        "n",
        "4"
      ],
      [
        "y",
        "u"
      ],
      [
        "j",
        "i"
      ],
      [
        "ng",
        "4"
      ],
      [
        "h",
        "a"
      ],
      [
        "i",
        "2"
      ],
      [
        "t",
        "1"
      ],
      [
        "ge",
        "3"
      ],
      [
        "o",
        "e"
      ],
      [
        "k",
        "6"
      ],
      [
        "e",
        "oi"
      ],
      [
        "n",
        "1"
      ],
      [
        "a",
        "u"
      ],
      [
        "s",
        "i"
      ],
      [
        "ng",
        "2"
      ],
      [
        "g",
        "o"
      ],
      [
        "i",
        "3"
      ],
      [
        "n",
        "6"
      ],
      [
        "d",
        "ou"
      ],
      [
        "i",
        "1"
      ],
      [
        "ja",
        "t1"
      ],
      [
        "ha",
        "i6"
      ],
      [
        "ng",
        "6"
      ],
      [
        "i",
        "4"
      ],
      [
        "k",
        "1"
      ],
      [
        "s",
        "a"
      ],
      [
        "ja",
        "u"
      ],
      [
        "k",
        "3"
      ],
      [
        "g",
        "aa"
      ],
      [
        "n",
        "2"
      ],
      [
        "eoi",
        "5"
      ],
      [
        "o",
        "2"
      ],
      [
        "i",
        "5"
      ],
      [
        "u",
        "ng1"
      ],
      [
        "j",
        "yu"
      ],
      [
        "ng",
        "o"
      ],
      [
        "g",
        "w"
      ],
      [
        "t",
        "6"
      ],
      [
        "d",
        "aa"
      ],
      [
        "m",
        "4"
      ],
      [
        "ou",
        "2"
      ],
      [
        "jau",
        "5"
      ],
      [
        "g",
        "a"
      ],
      [
        "k",
        "eoi5"
      ],
      [
        "u",
        "ng4"
      ],
      [
        "ngo",
        "5"
      ],
      [
        "n",
        "3"
      ],
      [
        "ng",
        "3"
      ],
      [
        "u",
        "3"
      ],
      [
        "g",
        "i"
      ],
      [
        "e",
        "o"
      ],
      [
        "u",
        "2"
      ],
      [
        "h",
        "o"
      ],
      [
        "au",
        "6"
      ],
      [
        "ja",
        "n4"
      ],
      [
        "w",
        "a"
      ],
      [
        "t",
        "3"
      ],
      [
        "aa",
        "1"
      ],
      [
        "z",
        "i"
      ],
      [
        "o",
        "k3"
      ],
      [
        "s",
        "oe"
      ],
      [
        "d",
        "a"
      ],
      [
        "eoi",
        "3"
      ],
      [
        "u",
        "6"
      ],
      [
        "e",
        "i6"
      ],
      [
        "w",
        "aa"
      ],
      [
        "a",
        "t1"
      ],
      [
        "go",
        "3"
      ],
      [
        "n",
        "e"
      ],
      [
        "d",
        "i"
      ],
      [
        "s",
        "yu"
      ],
      [
        "h",
        "ou2"
      ],
      [
        "m",
        "1"
      ],
      [
        "ng",
        "5"
      ],
      [
        "w",
        "u"
      ],
      [
        "z",
        "yu"
      ],
      [
        "dou",
        "1"
      ],
      [
        "c",
        "i"
      ],
      [
        "z",
        "au6"
      ],
      [
        "p",
        "6"
      ],
      [
        "s",
        "e"
      ],
      [
        "f",
        "aa"
      ],
      [
        "h",
        "aa"
      ],
      [
        "b",
        "i"
      ],
      [
        "u",
        "k6"
      ],
      [
        "m",
        "a"
      ],
      [
        "z",
        "i2"
      ],
      [
        "l",
        "i"
      ],
      [
        "s",
        "aa"
      ],
      [
        "ha",
        "i2"
      ],
      [
        "ho",
        "k6"
      ],
      [
        "d",
        "ei6"
      ],
      [
        "m",
        "i"
      ],
      [
        "ji",
        "5"
      ],
      [
        "d",
        "o"
      ],
      [
        "u",
        "ng6"
      ],
      [
        "z",
        "o2"
      ],
      [
        "z",
        "ung1"
      ],
      [
        "m",
        "3"
      ],
      [
        "e",
        "i4"
      ],
      [
        "t",
        "ung4"
      ],
      [
        "b",
        "at1"
      ],
      [
        "z",
        "i1"
      ],
      [
        "ou",
        "5"
      ],
      [
        "b",
        "aa"
      ],
      [
        "au",
        "4"
      ],
      [
        "z",
        "a"
      ],
      [
        "oe",
        "ng1"
      ],
      [
        "dou",
        "2"
      ],
      [
        "au",
        "2"
      ],
      [
        "j",
        "oe"
      ],
      [
        "daa",
        "i6"
      ],
      [
        "go",
        "ng2"
      ],
      [
        "ne",
        "1"
      ],
      [
        "m",
        "aa"
      ],
      [
        "syu",
        "1"
      ],
      [
        "m",
        "2"
      ],
      [
        "f",
        "o"
      ],
      [
        "gw",
        "ok3"
      ],
      [
        "n",
        "i"
      ],
      [
        "l",
        "a"
      ],
      [
        "ha",
        "u6"
      ],
      [
        "ga",
        "m3"
      ],
      [
        "ou",
        "6"
      ],
      [
        "s",
        "i6"
      ],
      [
        "t",
        "a"
      ],
      [
        "z",
        "e"
      ],
      [
        "z",
        "i6"
      ],
      [
        "h",
        "e"
      ],
      [
        "ji",
        "4"
      ],
      [
        "da",
        "k1"
      ],
      [
        "r",
        "ngo5"
      ],
      [
        "gaa",
        "1"
      ],
      [
        "b",
        "u"
      ],
      [
        "gw",
        "o"
      ],
      [
        "t",
        "i"
      ],
      [
        "l",
        "aa1"
      ],
      [
        "e",
        "i5"
      ],
      [
        "wa",
        "i6"
      ],
      [
        "dou",
        "6"
      ],
      [
        "u",
        "1"
      ],
      [
        "h",
        "eoi3"
      ],
      [
        "aa",
        "3"
      ],
      [
        "ni",
        "n4"
      ],
      [
        "si",
        "4"
      ],
      [
        "ji",
        "u3"
      ],
      [
        "si",
        "u2"
      ],
      [
        "m",
        "u"
      ],
      [
        "zyu",
        "6"
      ],
      [
        "r",
        "keoi5"
      ],
      [
        "c",
        "eo"
      ],
      [
        "mi",
        "n6"
      ],
      [
        "f",
        "a"
      ],
      [
        "m",
        "ou5"
      ],
      [
        "n",
        "5"
      ],
      [
        "ji",
        "k6"
      ],
      [
        "ji",
        "n4"
      ],
      [
        "u",
        "ng2"
      ],
      [
        "d",
        "i1"
      ],
      [
        "oi",
        "3"
      ],
      [
        "si",
        "1"
      ],
      [
        "oi",
        "4"
      ],
      [
        "u",
        "k1"
      ],
      [
        "ge",
        "i2"
      ],
      [
        "ou",
        "4"
      ],
      [
        "waa",
        "6"
      ],
      [
        "ceo",
        "t1"
      ],
      [
        "h",
        "o2"
      ],
      [
        "o",
        "ng4"
      ],
      [
        "ja",
        "t6"
      ],
      [
        "saa",
        "ng1"
      ],
      [
        "c",
        "a"
      ],
      [
        "ne",
        "i5"
      ],
      [
        "ta",
        "i2"
      ],
      [
        "ma",
        "n4"
      ],
      [
        "r",
        "z"
      ],
      [
        "gwo",
        "3"
      ],
      [
        "daa",
        "n6"
      ],
      [
        "soe",
        "ng5"
      ],
      [
        "b",
        "e"
      ],
      [
        "g",
        "ung1"
      ],
      [
        "wu",
        "i5"
      ],
      [
        "c",
        "yu"
      ],
      [
        "oi",
        "1"
      ],
      [
        "faa",
        "t3"
      ],
      [
        "si",
        "k1"
      ],
      [
        "sa",
        "m1"
      ],
      [
        "go",
        "2"
      ],
      [
        "au",
        "3"
      ],
      [
        "gi",
        "ng1"
      ],
      [
        "do",
        "1"
      ],
      [
        "l",
        "ei4"
      ],
      [
        "j",
        "i6"
      ],
      [
        "oe",
        "ng4"
      ],
      [
        "n",
        "aa"
      ],
      [
        "t",
        "aa"
      ],
      [
        "l",
        "au4"
      ],
      [
        "z",
        "ok3"
      ],
      [
        "si",
        "ng4"
      ],
      [
        "ou",
        "3"
      ],
      [
        "se",
        "ng1"
      ],
      [
        "p",
        "i"
      ],
      [
        "jyu",
        "n4"
      ],
      [
        "c",
        "aa"
      ],
      [
        "z",
        "aa"
      ],
      [
        "o",
        "i6"
      ],
      [
        "o",
        "k6"
      ]
    ]
  }
}