{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      "!": 3,
      "'": 4,
      "1": 5,
      "2": 6,
      ",": 7,
      "3": 8,
      ".": 9,
      "4": 10,
      "5": 11,
      "6": 12,
      "?": 13,
      "a": 14,
      "b": 15,
      "c": 16,
      "d": 17,
      "e": 18,
      "f": 19,
      "g": 20,
      "h": 21,
      "i": 22,
      "j": 23,
      "k": 24,
      "l": 25,
      "m": 26,
      "n": 27,
      "o": 28,
      "p": 29,
      "q": 30,
      "r": 31,
      "s": 32,
      "t": 33,
      "u": 34,
      "v": 35,
      "w": 36,
      "x": 37,
      "y": 38,
      "z": 39,
      "aa": 40,
      "ng": 41,
      "oe": 42,
      "oi": 43,
      "yu": 44,
      "on": 45,
      "ot": 46,
      "ai": 47,
      "ou": 48,
      "au": 49,
      "ei": 50,
      "ung": 51,
      "at": 52,
      "in": 53,
      "an": 54,
      "eoi": 55,
      "ing": 56,
      "oeng": 57,
      "ok": 58,
      "ong": 59,
      "aan": 60,
      "aai": 61,
      "iu": 62,
      "ik": 63,
      "am": 64,
      "yun": 65,
      "uk": 66,
      "ang": 67,
      "ui": 68,
      "eng": 69,
      "un": 70,
      "ak": 71,
      "aau": 72,
      "aak": 73,
      "ap": 74,
      "im": 75,
      "aam": 76,
      "aat": 77,
      "aang": 78,
      "yut": 79,
      "eon": 80,
      "it": 81,
      "eot": 82,
      "aap": 83,
      "oek": 84,
      "ip": 85,
      "ut": 86,
      "ek": 87,
      "kw": 88,
      "em": 89,
      "et": 90,
      "ep": 91,
      "eu": 92,
      "oet": 93,
      "ge": 94,
      "hai": 95,
      "jat": 96,
      "dou": 97,
      "zi": 98,
      "ji": 99,
      "jau": 100,
      "si": 101,
      "jan": 102,
      "gw": 103,
      "go": 104,
      "keoi": 105,
      "zung": 106,
      "ngo": 107,
      "zau": 108,
      "soeng": 109,
      "hou": 110,
      "gaa": 111,
      "gam": 112,
      "tung": 113,
      "zo": 114,
      "zyu": 115,
      "dei": 116,
      "hok": 117,
      "jyu": 118,
      "wai": 119,
      "hau": 120,
      "jin": 121,
      "daai": 122,
      "mou": 123,
      "bat": 124,
      "gei": 125,
      "wui": 126,
      "gong": 127,
      "syu": 128,
      "siu": 129,
      "ci": 130,
      "lei": 131,
      "waa": 132,
      "man": 133,
      "ne": 134,
      "dak": 135,
      "gwok": 136,
      "sing": 137,
      "jiu": 138,
      "joeng": 139,
      "fu": 140,
      "sau": 141,
      "tai": 142,
      "jyun": 143,
      "ho": 144,
      "ging": 145,
      "heoi": 146,
      "min": 147,
      "zoeng": 148,
      "jing": 149,
      "hei": 150,
      "laa": 151,
      "hoeng": 152,
      "nin": 153,
      "jik": 154,
      "bin": 155,
      "sik": 156,
      "daan": 157,
      "fong": 158,
      "gau": 159,
      "gwo": 160,
      "ze": 161,
      "di": 162,
      "gung": 163,
      "bun": 164,
      "sam": 165,
      "cing": 166,
      "saang": 167,
      "nei": 168,
      "ceot": 169,
      "zing": 170,
      "sai": 171,
      "lai": 172,
      "kei": 173,
      "zou": 174,
      "bei": 175,
      "do": 176,
      "seng": 177,
      "san": 178,
      "zok": 179,
      "lou": 180,
      "faan": 181,
      "mei": 182,
      "cung": 183,
      "lau": 184,
      "jung": 185,
      "zoi": 186,
      "seoi": 187,
      "faat": 188,
      "cin": 189,
      "gin": 190,
      "fan": 191,
      "hoi": 192,
      "maa": 193,
      "deoi": 194,
      "ling": 195,
      "zik": 196,
      "haa": 197,
      "leoi": 198,
      "bou": 199,
      "duk": 200,
      "gu": 201,
      "gaai": 202,
      "dung": 203,
      "loeng": 204,
      "sin": 205,
      "dik": 206,
      "gaau": 207,
      "zai": 208,
      "coeng": 209,
      "dai": 210,
      "dim": 211,
      "zeoi": 212,
      "ni": 213,
      "maai": 214,
      "so": 215,
      "sang": 216,
      "tau": 217,
      "cyun": 218,
      "sat": 219,
      "dong": 220,
      "se": 221,
      "sap": 222,
      "zan": 223,
      "wong": 224,
      "tin": 225,
      "jyut": 226,
      "je": 227,
      "mun": 228,
      "gaan": 229,
      "mat": 230,
      "hung": 231,
      "gan": 232,
      "baan": 233,
      "ming": 234,
      "wan": 235,
      "gok": 236,
      "loi": 237,
      "ceoi": 238,
      "ngoi": 239,
      "sei": 240,
      "jam": 241,
      "baa": 242,
      "nang": 243,
      "taai": 244,
      "doi": 245,
      "jap": 246,
      "syun": 247,
      "saam": 248,
      "haau": 249,
      "faa": 250,
      "mong": 251,
      "tou": 252,
      "fung": 253,
      "fo": 254
    },
    "merges": [
      [
        "a",
        "a"
      ],
      [
        "n",
        "g"
      ],
      [
        "o",
        "e"
      ],
      [
        "o",
        "i"
      ],
      [
        "y",
        "u"
      ],
      [
        "o",
        "n"
      ],
      [
        "o",
        "t"
      ],
      [
        "a",
        "i"
      ],
      [
        "o",
        "u"
      ],
      [
        "a",
        "u"
      ],
      [
        "e",
        "i"
      ],
      [
        "u",
        "ng"
      ],
      [
        "a",
        "t"
      ],
      [
        "i",
        "n"
      ],
      [
        "a",
        "n"
      ],
      [
        "e",
        "oi"
      ],
      [
        "i",
        "ng"
      ],
      [
        "oe",
        "ng"
      ],
      [
        "o",
        "k"
      ],
      [
        "o",
        "ng"
      ],
      [
        "aa",
        "n"
      ],
      [
        "aa",
        "i"
      ],
      [
        "i",
        "u"
      ],
      [
        "i",
        "k"
      ],
      [
        "a",
        "m"
      ],
      [
        "yu",
        "n"
      ],
      [
        "u",
        "k"
      ],
      [
        "a",
        "ng"
      ],
      [
        "u",
        "i"
      ],
      [
        "e",
        "ng"
      ],
      [
        "u",
        "n"
      ],
      [
        "a",
        "k"
      ],
      [
        "aa",
        "u"
      ],
      [
        "aa",
        "k"
      ],
      [
        "a",
        "p"
      ],
      [
        "i",
        "m"
      ],
      [
        "aa",
        "m"
      ],
      [
        "aa",
        "t"
      ],
      [
        "aa",
        "ng"
      ],
      [
        "yu",
        "t"
      ],
      [
        "e",
        "on"
      ],
      [
        "i",
        "t"
      ],
      [
        "e",
        "ot"
      ],
      [
        "aa",
        "p"
      ],
      [
        "oe",
        "k"
      ],
      [
        "i",
        "p"
      ],
      [
        "u",
        "t"
      ],
      [
        "e",
        "k"
      ],
      [
        "k",
        "w"
      ],
      [
        "e",
        "m"
      ],
      [
        "e",
        "t"
      ],
      [
        "e",
        "p"
      ],
      [
        "e",
        "u"
      ],
      [
        "oe",
        "t"
      ],
      [
        "g",
        "e"
      ],
      [
        "h",
        "ai"
      ],
      [
        "j",
        "at"
      ],
      [
        "d",
        "ou"
      ],
      [
        "z",
        "i"
      ],
      [
        "j",
        "i"
      ],
      [
        "j",
        "au"
      ],
      [
        "s",
        "i"
      ],
      [
        "j",
        "an"
      ],
      [
        "g",
        "w"
      ],
      [
        "g",
        "o"
      ],
      [
        "k",
        "eoi"
      ],
      [
        "z",
        "ung"
      ],
      [
        "ng",
        "o"
      ],
      [
        "z",
        "au"
      ],
      [
        "s",
        "oeng"
      ],
      [
        "h",
        "ou"
      ],
      [
        "g",
        "aa"
      ],
      [
        "g",
        "am"
      ],
      [
        "t",
        "ung"
      ],
      [
        "z",
        "o"
      ],
      [
        "z",
        "yu"
      ],
      [
        "d",
        "ei"
      ],
      [
        "h",
        "ok"
      ],
      [
        "j",
        "yu"
      ],
      [
        "w",
        "ai"
      ],
      [
        "h",
        "au"
      ],
      [
        "j",
        "in"
      ],
      [
        "d",
        "aai"
      ],
      [
        "m",
        "ou"
      ],
      [
        "b",
        "at"
      ],
      [
        "g",
        "ei"
      ],
      [
        "w",
        "ui"
      ],
      [
        "g",
        "ong"
      ],
      [
        "s",
        "yu"
      ],
      [
        "s",
        "iu"
      ],
      [
        "c",
        "i"
      ],
      [
        "l",
        "ei"
      ],
      [
        "w",
        "aa"
      ],
      [
        "m",
        "an"
      ],
      [
        "n",
        "e"
      ],
      [
        "d",
        "ak"
      ],
      [
        "gw",
        "ok"
      ],
      [
        "s",
        "ing"
      ],
      [
        "j",
        "iu"
      ],
      [
        "j",
        "oeng"
      ],
      [
        "f",
        "u"
      ],
      [
        "s",
        "au"
      ],
      [
        "t",
        "ai"
      ],
      [
        "j",
        "yun"
      ],
      [
        "h",
        "o"
      ],
      [
        "g",
        "ing"
      ],
      [
        "h",
        "eoi"
      ],
      [
        "m",
        "in"
      ],
      [
        "z",
        "oeng"
      ],
      [
        "j",
        "ing"
      ],
      [
        "h",
        "ei"
      ],
      [
        "l",
        "aa"
      ],
      [
        "h",
        "oeng"
      ],
      [
        "n",
        "in"
      ],
      [
        "j",
        "ik"
      ],
      [
        "b",
        "in"
      ],
      [
        "s",
        "ik"
      ],
      [
        "d",
        "aan"
      ],
      [
        "f",
        "ong"
      ],
      [
        "g",
        "au"
      ],
      [
        "gw",
        "o"
      ],
      [
        "z",
        "e"
      ],
      [
        "d",
        "i"
      ],
      [
        "g",
        "ung"
      ],
      [
        "b",
        "un"
      ],
      [
        "s",
        "am"
      ],
      [
        "c",
        "ing"
      ],
      [
        "s",
        "aang"
      ],
      [
        "n",
        "ei"
      ],
      [
        "c",
        "eot"
      ],
      [
        "z",
        "ing"
      ],
      [
        "s",
        "ai"
      ],
      [
        "l",
        "ai"
      ],
      [
        "k",
        "ei"
      ],
      [
        "z",
        "ou"
      ],
      [
        "b",
        "ei"
      ],
      [
        "d",
        "o"
      ],
      [
        "s",
        "eng"
      ],
      [
        "s",
        "an"
      ],
      [
        "z",
        "ok"
      ],
      [
        "l",
        "ou"
      ],
      [
        "f",
        "aan"
      ],
      [
        "m",
        "ei"
      ],
      [
        "c",
        "ung"
      ],
      [
        "l",
        "au"
      ],
      [
        "j",
        "ung"
      ],
      [
        "z",
        "oi"
      ],
      [
        "s",
        "eoi"
      ],
      [
        "f",
        "aat"
      ],
      [
        "c",
        "in"
      ],
      [
        "g",
        "in"
      ],
      [
        "f",
        "an"
      ],
      [
        "h",
        "oi"
      ],
      [
        "m",
        "aa"
      ],
      [
        "d",
        "eoi"
      ],
      [
        "l",
        "ing"
      ],
      [
        "z",
        "ik"
      ],
      [
        "h",
        "aa"
      ],
      [
        "l",
        "eoi"
      ],
      [
        "b",
        "ou"
      ],
      [
        "d",
        "uk"
      ],
      [
        "g",
        "u"
      ],
      [
        "g",
        "aai"
      ],
      [
        "d",
        "ung"
      ],
      [
        "l",
        "oeng"
      ],
      [
        "s",
        "in"
      ],
      [
        "d",
        "ik"
      ],
      [
        "g",
        "aau"
      ],
      [
        "z",
        "ai"
      ],
      [
        "c",
        "oeng"
      ],
      [
        "d",
        "ai"
      ],
      [
        "d",
        "im"
      ],
      [
        "z",
        "eoi"
      ],
      [
        "n",
        "i"
      ],
      [
        "m",
        "aai"
      ],
      [
        "s",
        "o"
      ],
      [
        "s",
        "ang"
      ],
      [
        "t",
        "au"
      ],
      [
        "c",
        "yun"
      ],
      [
        "s",
        "at"
      ],
      [
        "d",
        "ong"
      ],
      [
        "s",
        "e"
      ],
      [
        "s",
        "ap"
      ],
      [
        "z",
        "an"
      ],
      [
        "w",
        "ong"
      ],
      [
        "t",
        "in"
      ],
      [
        "j",
        "yut"
      ],
      [
        "j",
        "e"
      ],
      [
        "m",
        "un"
      ],
      [
        "g",
        "aan"
      ],
      [
        "m",
        "at"
      ],
      [
        "h",
        "ung"
      ],
      [
        "g",
        "an"
      ],
      [
        "b",
        "aan"
      ],
      [
        "m",
        "ing"
      ],
      [
        "w",
        "an"
      ],
      [
        "g",
        "ok"
      ],
      [
        "l",
        "oi"
      ],
      [
        "c",
        "eoi"
      ],
      [
        "ng",
        "oi"
      ],
      [
        "s",
        "ei"
      ],
      [
        "j",
        "am"
      ],
      [
        "b",
        "aa"
      ],
      [
        "n",
        "ang"
      ],
      [
        "t",
        "aai"
      ],
      [
        "d",
        "oi"
      ],
      [
        "j",
        "ap"
      ],
      [
        "s",
        "yun"
      ],
      [
        "s",
        "aam"
      ],
      [
        "h",
        "aau"
      ],
      [
        "f",
        "aa"
      ],
      [
        "m",
        "ong"
      ],
      [
        "t",
        "ou"
      ],
      [
        "f",
        "ung"
      ],
      [
        "f",
        "o"
      ]
    ]
  }
}